{
  "accelerated-jk": { "branch": "master" },
  "ccc.nvim": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "dial.nvim": { "branch": "master" },
  "emmet-vim": { "branch": "master" },
  "fff": { "branch": "main" },
  "fidget.nvim": { "branch": "main" },
  "gitlinker.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "gruvbox-material": { "branch": "master" },
  "hlchunk.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "nvim-bqf": { "branch": "main" },
  "nvim-hlslens": { "branch": "main" },
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "main" },
  "nvim-treesitter-textobjects": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "securemodelines": { "branch": "master" },
  "snacks.nvim": { "branch": "main" },
  "toggleterm.nvim": { "branch": "main" },
  "treesj": { "branch": "main" },
  "vim-ambiwidth": { "branch": "main" },
  "vim-asterisk": { "branch": "master" },
  "vim-easy-align": { "branch": "master" },
  "vim-gfm-syntax": { "branch": "master" },
  "vim-goaddtags": { "branch": "master" },
  "vim-godoc": { "branch": "master" },
  "vim-goimpl": { "branch": "master" },
  "vim-goimports": { "branch": "master" },
  "vim-gomod": { "branch": "main" },
  "vim-gorename": { "branch": "master" },
  "vim-gorun": { "branch": "master" },
  "vim-indent-guides": { "branch": "master" },
  "vim-maketable": { "branch": "master" },
  "vim-operator-replace": { "branch": "master" },
  "vim-operator-user": { "branch": "master" },
  "vim-sandwich": { "branch": "master" },
  "vimdoc-ja": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "yazi.nvim": { "branch": "main" }
}
