# Tap
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Shell
brew 'curl'
brew 'dos2unix'
brew 'exiftool'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'nkf'
brew 'openssh'
brew 'rename'
brew 'rsync'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'unrar'
brew 'watch'
brew 'wget'

## Git
brew 'git', args: ['without-completions']
brew 'git-flow-avh'
brew 'source-highlight'
brew 'ghq'
brew 'gnupg'
brew 'pinentry-mac'

## Zsh
brew 'zsh'
brew 'zplug'
brew 'colordiff'
brew 'exa'
brew 'peco'
brew 'terminal-notifier'

## Grep
brew 'ripgrep'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'

## Python
brew 'python2'
brew 'python3'

## Ruby
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'ruby-build'

## Golang
brew 'go'
brew 'dep'
#tap 'go-delve/delve'
#brew 'delve'

## Node.js
brew 'nodebrew'

## Java
cask 'java8' unless system '/usr/libexec/java_home --failfast'
brew 'maven'
brew 'tomcat'

## Vim
brew 'macvim', args: ['with-override-system-vim', 'with-lua', 'with-luajit', 'with-python3']
brew 'neovim', args: ['HEAD']

# Mac Apps
cask 'xquartz'
cask 'eclipse-jee'
cask '1password'
cask 'appcleaner'
cask 'copyq'
cask 'finicky'
cask 'google-japanese-ime'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'mysqlworkbench'
cask 'sourcetree'
cask 'the-unarchiver'
cask 'vimr'
cask 'visual-studio-code'
#cask 'gitify'
#cask 'skype'
#cask 'vlc'

## Browser
cask 'firefox'
cask 'google-chrome'

## Fonts
cask 'font-ricty-diminished'

## VirtualBox
cask 'virtualbox'
cask 'virtualbox-extension-pack'

## Vagrant
#cask 'vagrant'
#cask 'vagrant-manager'

## Cloud Storage
#cask 'dropbox'
#cask 'google-backup-and-sync'

## Database
#cask 'psequel'
#cask 'sequel-pro'

# App Store
brew 'mas'
mas 'ForkLift', id: 412448059
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Monosnap', id: 540348655
mas 'Slack', id: 803453959
#mas 'Reeder', id: 880001334
#mas 'Twitter', id: 409789998
