# Tap
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'cloudflare/cloudflare'
tap 'golangci/tap'

# Shell
brew 'awscli'
brew 'cloudflared'
brew 'curl'
brew 'dos2unix'
brew 'exiftool'
brew 'fzf'
brew 'fzy'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'iproute2mac'
brew 'jq'
brew 'mysql-client'
brew 'nkf'
brew 'openssh'
brew 'rsync'
brew 'shellcheck'
brew 'shfmt'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'unrar'
brew 'watch'
brew 'wget'

## Git
brew 'git'
brew 'git-flow-avh'
brew 'git-lfs'
brew 'source-highlight'
brew 'ghq'
brew 'gnupg'
brew 'pinentry-mac'

## Zsh
brew 'zsh'
brew 'zplug'
brew 'colordiff'
brew 'exa'
brew 'peco'
brew 'terminal-notifier'

## Grep
brew 'ripgrep'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'

## Python
brew 'python'

## Ruby
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'ruby-build'

## Golang
brew 'go'
brew 'golangci-lint'

## Node.js
brew 'nodebrew'

## Java
cask 'java8' unless system '/usr/libexec/java_home --failfast'
brew 'maven'
brew 'tomcat@8'

## Vim
brew 'macvim', args: ['with-override-system-vim', 'with-lua', 'with-luajit']
brew 'neovim', args: ['HEAD']

# Mac Apps
cask 'xquartz'
cask '1password'
cask 'appcleaner'
cask 'docker'
cask 'finicky'
cask 'google-japanese-ime'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'mysqlworkbench'
cask 'skype'
cask 'sourcetree'
cask 'the-unarchiver'
cask 'vlc'

## Browser
cask 'firefox'
cask 'google-chrome'

## Fonts
cask 'font-ricty-diminished'
cask 'font-hackgen'

## VirtualBox
cask 'virtualbox'
cask 'virtualbox-extension-pack'

## Cloud Storage
cask 'dropbox'
cask 'google-drive-file-stream'

## Database
cask 'psequel'
cask 'sequel-pro'

# App Store
brew 'mas'
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Monosnap', id: 540348655
mas 'Slack', id: 803453959
#mas 'ForkLift', id: 412448059
#mas 'Reeder', id: 880001334
