## Tap
tap 'golangci/tap'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

## Command
brew 'automake'
brew 'cmake'
brew 'colordiff'
brew 'dos2unix'
brew 'exiftool'
brew 'gettext'
brew 'imagemagick'
brew 'jq'
brew 'libtool'
brew 'ninja'
brew 'nkf'
brew 'pkg-config'
brew 'rsync'
brew 'unrar'
brew 'watch'

## find
brew 'fd'

## git
brew 'gh'
brew 'ghq'
brew 'git'
brew 'git-flow-avh'
brew 'git-lfs'
brew 'gnupg'
brew 'pinentry-mac'
brew 'source-highlight'

## grep
brew 'ripgrep'

## ls
brew 'exa'
brew 'lsd'

## ssh
brew 'openssh'
brew 'ssh-copy-id'

## vim
brew 'vim', args: ['HEAD']
#brew 'neovim', args: ['HEAD']

## zsh
brew 'terminal-notifier'
brew 'zsh'

## Database
brew 'mysql-client'
brew 'sqlite'

## Format
brew 'shfmt'

## Fuzzy finder
brew 'fzf'
brew 'fzy'
brew 'peco'

## Lint
brew 'shellcheck'

## Network
brew 'curl'
brew 'httpie'
brew 'iproute2mac'
brew 'wget'

## Golang
brew 'go'
brew 'golangci-lint'

## Node.js
brew 'nodebrew'

## Mac Apps
cask 'xquartz'
cask '1password'
cask 'appcleaner'
cask 'docker'
cask 'finicky'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'mysqlworkbench'
cask 'rectangle'
cask 'the-unarchiver'

## Cloud Storage
cask 'dropbox'
cask 'google-drive-file-stream'

## Fonts
cask 'font-hackgen'
cask 'font-ricty-diminished'

# App Store
#brew 'mas'
#mas 'ForkLift', id: 412448059
#mas 'Monosnap', id: 540348655
