# vi: set ft=ruby :

## Command
brew "colordiff"
brew "fnm"
brew "ghq"
brew "jq"
brew "starship"
brew "zoxide"

## cat
brew "bat"

## find
brew "fd"

## git
brew "gh"
brew "git"
brew "git-flow-avh"
brew "git-lfs"

## grep
brew "ripgrep"

## ls
brew "eza"
brew "lsd"

## vim
brew "vim"

## Fuzzy finder
brew "fzf"
brew "fzy"
brew "peco"

if OS.mac?
  ## Tap
  tap "daipeihust/tap"
  tap "golangci/tap"
  tap "wez/wezterm"

  ## Command
  brew "automake"
  brew "cmake"
  brew "coreutils"
  brew "diffutils"
  brew "dos2unix"
  brew "ed"
  brew "exiftool"
  brew "findutils"
  brew "gawk"
  brew "gettext"
  brew "gnu-sed"
  brew "gnu-tar"
  brew "grep"
  brew "gzip"
  brew "im-select"
  brew "imagemagick"
  brew "libtool"
  brew "ninja"
  brew "nkf"
  brew "p7zip"
  brew "pkg-config"
  brew "rsync"
  brew "watch"

  ## grep
  brew "ripgrep-all"

  ## ssh
  brew "openssh"
  brew "ssh-copy-id"

  ## vim
  brew "neovim"

  ## zsh
  brew "terminal-notifier"
  brew "zsh"

  ## Database
  brew "mysql-client"
  brew "sqlite"

  ## Format
  brew "shfmt"

  ## Lint
  brew "checkmake"
  brew "shellcheck"
  brew "stylua"
  brew "yamllint"

  ## Network
  brew "curl"
  brew "httpie"
  brew "iproute2mac"
  brew "wget"

  ## Golang
  brew "go"
  brew "golangci-lint"

  ## Mac Apps
  cask "xquartz"
  cask "1password"
  cask "1password-cli"
  cask "appcleaner"
  cask "docker"
  cask "finicky"
  cask "iterm2"
  cask "karabiner-elements"
  cask "keepingyouawake"
  cask "monitorcontrol"
  cask "mysqlworkbench"
  cask "raycast"
  cask "rectangle"
  cask "the-unarchiver"
  cask "wez/wezterm/wezterm"

  ## Fonts
  cask "font-biz-udgothic"
  cask "font-biz-udmincho"
  cask "font-biz-udpgothic"
  cask "font-biz-udpmincho"
  cask "font-cica"
  cask "font-hackgen"
  cask "font-ricty-diminished"
  cask "font-udev-gothic"
  cask "font-udev-gothic-nf"

  # App Store
  #brew "mas"
  #mas "Monosnap", id: 540348655
end
