# vi: set ft=ruby :

## Command
brew "colordiff"
brew "gh"
brew "ghq"
brew "jq"
brew "sheldon"
brew "starship"
brew "tree-sitter"
brew "zoxide"

## cat
brew "bat"

## find
brew "fd"

## git
brew "git"
brew "git-lfs"

## grep
brew "ripgrep"
brew "ripgrep-all"

## ls
brew "eza"
brew "lsd"

## lsp
brew "basedpyright"
brew "lua-language-server"
brew "typescript-language-server"
brew "vue-language-server"

## Fuzzy finder
brew "fzf"

## Neovim
brew "luarocks"
brew "neovim"

if OS.mac?
  ## Command
  brew "coreutils"
  brew "diffutils"
  brew "dos2unix"
  brew "ed"
  brew "exiftool"
  brew "findutils"
  brew "gawk"
  brew "gnu-sed"
  brew "gnu-tar"
  brew "grep"
  brew "gzip"
  brew "imagemagick"
  brew "nkf"
  brew "p7zip"
  brew "rsync"
  brew "watch"

  ## ssh
  brew "openssh"
  brew "ssh-copy-id"

  ## vim
  brew "vim"

  ## zsh
  brew "zsh"

  ## Database
  brew "mysql-client"
  brew "sqlite"

  ## Format
  brew "shfmt"
  brew "stylua"

  ## Go
  brew "go"
  brew "golangci-lint"

  ## Lint
  brew "checkmake"
  brew "editorconfig-checker"
  brew "luacheck"
  brew "shellcheck"
  brew "yamllint"

  ## Network
  brew "curl"
  brew "httpie"
  brew "iproute2mac"
  brew "wget"

  ## Node.js
  brew "fnm"

  ## Mac Apps
  #cask "xquartz"
  #cask "1password"
  #cask "1password-cli"
  #cask "adobe-acrobat-reader"
  #cask "appcleaner"
  cask "devtoys"
  #cask "docker"
  cask "ghostty"
  cask "iterm2"
  cask "karabiner-elements"
  #cask "keepingyouawake"
  cask "monitorcontrol"
  cask "mysqlworkbench"
  #cask "raycast"
  cask "rectangle"
  cask "sequel-ace"
  #cask "the-unarchiver"
  cask "visual-studio-code"
  #cask "wezterm"

  ## Fonts
  cask "font-udev-gothic"
  cask "font-udev-gothic-nf"

  # App Store
  #brew "mas"
  #mas "Monosnap", id: 540348655
end
