tap 'homebrew/binary'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'fisherman/tap'
tap 'go-delve/delve'
tap 'neovim/neovim'

brew 'ansifilter'
brew 'colordiff'
brew 'composer'
brew 'curl'
brew 'delve'
brew 'dos2unix'
brew 'exiftool'
brew 'fish'
brew 'fisherman'
brew 'ghq'
brew 'git', args: ['without-completions']
brew 'gnupg'
brew 'go'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'macvim', args: ['override-system-vim', 'with-lua', 'with-luajit', 'with-python3']
brew 'mas'
brew 'moreutils'
brew 'neovim'
brew 'nkf'
brew 'nodebrew'
brew 'openssh'
brew 'peco'
brew 'pinentry-mac'
brew 'putty'
brew 'python'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'renameutils'
brew 'ripgrep'
brew 'rsync'
brew 'ruby-build'
brew 'source-highlight'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'
brew 'tmux'
brew 'unrar'
brew 'watch'
brew 'wget'

cask '1password'
cask 'appcleaner'
cask 'atom'
cask 'clipy'
cask 'dropbox'
cask 'finicky'
cask 'firefox'
cask 'font-myrica'
cask 'font-ricty-diminished'
cask 'font-source-han-code-jp'
cask 'gitify'
cask 'google-chrome'
cask 'google-drive'
cask 'google-hangouts'
cask 'google-japanese-ime'
cask 'insomnia'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'keepingyouawake'
cask 'psequel'
cask 'sequel-pro'
cask 'the-unarchiver'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vimr'
cask 'virtualbox'
cask 'vlc'
cask 'xquartz'

mas 'ForkLift', id: 412448059
mas 'Monosnap', id: 540348655
mas 'Reeder',   id: 880001334
mas 'Slack',    id: 803453959
mas 'Twitter',  id: 409789998
