tap 'homebrew/dupes'
tap 'homebrew/apache'
tap 'homebrew/php'
tap 'homebrew/binary'
tap 'homebrew/versions'
tap 'homebrew/brewdler'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'peco/peco'
tap 'motemen/ghq'
tap 'sanemat/font'

brew 'zsh'
brew 'git', args: ['without-completions']
brew 'jq'
brew 'httpie'
brew 'node'
brew 'sqlite'
brew 'macvim', args: ['override-system-vim', 'with-lua', 'with-luajit']
brew 'the_silver_searcher'
brew 'the_platinum_searcher'
brew 'source-highlight'
brew 'curl'
brew 'wget'
brew 'watch'
brew 'rsync'
brew 'unrar'
brew 'exiftool'
brew 'imagemagick'
brew 'dos2unix'
brew 'colordiff'
brew 'nkf'
brew 'putty'
brew 'openssh'
brew 'ssh-copy-id'
brew 'rbenv'
brew 'rbenv-gem-rehash'
brew 'rbenv-default-gems'
brew 'ruby-build'
brew 'httpd24'
brew 'php55'
brew 'php55-mcrypt'
brew 'php55-xdebug'
brew 'composer'
brew 'python'
brew 'peco'
brew 'ghq'
brew 'ricty', args: ['vim-powerline']
brew 'tmux'
brew 'ansifilter'
brew 'reattach-to-user-namespace'
brew 'terminal-notifier'

brew 'brew-cask'
cask 'java'
cask 'xquartz'
cask 'dash'
cask 'slate'
cask 'clipy'
cask 'karabiner'
cask '1password'
cask 'skitch'
cask 'the-unarchiver'
cask 'sourcetree'
cask 'sequel-pro'
cask 'cyberduck'
cask 'dropbox'
cask 'pdftk'
cask 'iterm2'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
cask 'atom'
cask 'vlc'
cask 'toggldesktop'
cask 'firefox-ja'
cask 'firefoxdeveloperedition-ja'
cask 'google-drive'
cask 'google-chrome'
cask 'google-hangouts'
cask 'google-japanese-ime'
cask 'phpstorm-eap'
cask 'android-file-transfer'
cask 'keepingyouawake'
cask 'appcleaner'
cask 'flashlight'
