tap 'homebrew/dupes'
tap 'homebrew/apache'
tap 'homebrew/php'
tap 'homebrew/binary'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'sanemat/font'
tap 'fisherman/tap'

brew 'fish'
brew 'fisherman'
brew 'mas'
brew 'zsh'
brew 'gnupg2'
brew 'pinentry-mac'
brew 'git', args: ['without-completions']
brew 'go'
brew 'jq'
brew 'httpie'
brew 'nodebrew'
brew 'sqlite'
brew 'macvim', args: ['override-system-vim', 'with-lua', 'with-luajit']
brew 'moreutils'
brew 'the_silver_searcher'
brew 'the_platinum_searcher'
brew 'source-highlight'
brew 'curl'
brew 'wget'
brew 'watch'
brew 'rsync'
brew 'unrar'
brew 'exiftool'
brew 'imagemagick'
brew 'dos2unix'
brew 'colordiff'
brew 'nkf'
brew 'putty'
brew 'openssh'
brew 'ssh-copy-id'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'ruby-build'
brew 'httpd24'
brew 'php70'
brew 'php70-mcrypt'
brew 'composer'
brew 'python'
brew 'peco'
brew 'ghq'
brew 'ricty', args: ['vim-powerline']
brew 'tmux'
brew 'ansifilter'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'renameutils'
brew 'terminal-notifier'

cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'xquartz'
cask 'clipy'
cask 'gitify'
cask 'karabiner'
cask '1password'
cask 'the-unarchiver'
cask 'sourcetree'
cask 'sequel-pro'
cask 'psequel'
cask 'dropbox'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
cask 'atom'
cask 'vlc'
cask 'finicky'
cask 'firefox-ja'
cask 'firefoxdeveloperedition-ja'
cask 'flux'
cask 'google-drive'
cask 'google-chrome'
cask 'google-hangouts'
cask 'google-japanese-ime'
cask 'keepingyouawake'
cask 'appcleaner'

mas 'ForkLift', id: 412448059
mas 'Monosnap', id: 540348655
mas 'Reeder',   id: 880001334
mas 'Slack',    id: 803453959
mas 'Twitter',  id: 409789998
