fisherman/fishkit
fisherman/fishtape
fisherman/get
fisherman/getopts
fisherman/git_util
fisherman/menu
ponko2/fish-plugin-peco
rafaelrinaldi/pure
